[
  {
    "term": "Atom",
    "meaning": "The smallest part of an element that can exist."
  },
  {
    "term": "Proton",
    "meaning": "Positively charged subatomic particle with a relative mass of 1"
  },
  {
    "term": "Neutron",
    "meaning": "Subatomic particle without charge with a relative mass of 1"
  },
  {
    "term": "Electron",
    "meaning": "Negatively charged subatomic particle, with a very small relative mass"
  },
  {
    "term": "Nucleus",
    "meaning": "The positively charged centre of an atom, made from protons and neutrons."
  },
  {
    "term": "Atomic Number",
    "meaning": "The number of protons (or electrons) in an atom."
  },
  {
    "term": "Mass Number",
    "meaning": "The combined number of protons (or electrons) and neutrons in an atom."
  },
  {
    "term": "Relative formula mass",
    "meaning": "The mass of a compound relative to 1 proton or neutron",
  },
  {
    "term": "Ion",
    "meaning": "A charged atom; an atom that has lost or gained one or more electrons."
  },
  {
    "term": "Isotopes",
    "meaning": "Particles of the same element, but with different numbers of neutrons."
  },
  {
    "term": "Alkali metals",
    "meaning": "The elements in Group 1 of the periodic table"
  },
  {
    "term": "Group",
    "meaning": "A column on the periodic table."
  },
  {
    "term": "Period",
    "meaning": "A row on the periodic table."
  },
  {
    "term": "Periodic table",
    "meaning": "A table of elements arranged in order of atomic number, initially created by Mendeleev."
  },
  {
    "term": "Compound",
    "meaning": "A substance made up of two or more atoms that are chemically bonded."
  },
  {
    "term": "Chromatography",
    "meaning": "A method of separation that is used to separate a mixture of chemicals by distributing the components between two phases."
  },
  {
    "term": "Crystallisation",
    "meaning": "A method of separation involving the production of solid crystals from a solution through evaporation."
  },
  {
    "term": "Filtration",
    "meaning": "A method of separation that separates solids from liquids"
  },
  {
    "term": "Distillation",
    "meaning": "A method of separation used to separate a mixture of substances with different boiling points."
  },
  {
    "term": "Displacement",
    "meaning": "A reaction where a more reactive element displaces a less reactive element from a compound."
  },
  {
    "term": "Element",
    "meaning": "A substance made from a single type of atom."
  },
  {
    "term": "Halogens",
    "meaning": "The elements in Group 7 of the periodic table"
  },
  {
    "term": "Metal",
    "meaning": "An element that forms positive ions by delocalising electrons"
  },
  {
    "term": "Mixture",
    "meaning": "A substance made from one or more types of element or compound, not chemically bonded."
  },
  {
    "term": "Noble gases",
    "meaning": "The elements in Group 0 of the periodic table."
  },
  {
    "term": "Nuclear model",
    "meaning": "A model of the atom with most mass concentrated in the centre, in the positively charged nucleus, and with electrons orbiting in shells."
  },
  {
    "term": "Plum pudding model",
    "meaning": "A model of the atom, where electrons are dotted randomly throughout a ball of positive charge."
  },
  {
    "term": "Relative Atomic Mass",
    "meaning": "A value calculated by the average combined number of protons and neutrons, weighted by each isotope's abundance."
  },
  {
    "term": "Electron shells/Energy levels",
    "meaning": "Different layers where electrons are located in around an atom.",
  },
  {
    "term": "Transition metals",
    "meaning": "Metals found between Groups 2 and 3 in the periodic table."
  }
]
