[
  {
    "term": "Eukaryotic cell",
    "meaning": "Any cell that contains a nucleus storing genetic information. Found in plants and animals, and much larger than prokaryotic cells. Usually between 10 and 100 µm in diameter"
  },
  {
    "term": "Prokaryotic cell",
    "meaning": "A small type of cell without a nucleus - genetic material is a DNA loop, which may have one or two rings of DNA known as plasmids. Usually between 0.1 and 5.0 µm in diameter"
  },
  {
    "term": "Nucleus",
    "meaning": "An organelle found in eukaryotic cells that contains genetic material."
  },
  {
    "term": "Cytoplasm",
    "meaning": "A fluid-like substance found in cells"
  },
  {
    "term": "Cell membrane",
    "meaning": "The partially permeable membrane that controls what enters and leaves a cell"
  },
  {
    "term": "Mitochondrion",
    "meaning": "An organelle where respiration occurs"
  },
  {
    "term": "Ribosome",
    "meaning": "An organelle responsible for protein synthesis"
  },
  {
    "term": "Chloroplast",
    "meaning": "An organelle found in plant cells that is responsible for photosynthesis"
  },
  {
    "term": "Vacuole",
    "meaning": "An organelle found in plant cells that stores cell sap"
  },
  {
    "term": "Cell wall",
    "meaning": "The outer layer of plant and algal cells responsible for strengthening the cell. Made of cellulose"
  },
  {
    "term": "Specialised cell",
    "meaning": "A cell that has adapted to carry out a particular function"
  },
  {
    "term": "Organelle",
    "meaning": "A sub-cellular structure specialised to carry out a particular function"
  },
  {
    "term": "Differentiation",
    "meaning": "The process where an unspecialised stem cell gains individual characteristics and functions"
  },
  {
    "term": "Chromosome",
    "meaning": "A type of DNA structure found in the nucleus of a cell. Usually found in pairs"
  },
  {
    "term": "Gene",
    "meaning": "A section of a chromosome containing the code for the production of a particular protein"
  },
  {
    "term": "Stem cell",
    "meaning": "An undifferentiated cell capable of creating specialised cells of the same type."
  },
  {
    "term": "Embryonic stem cell",
    "meaning": "A type of stem cell found in embryos which is capable of differentiating into almost all kinds of cell found in the human body"
  },
  {
    "term": "Adult stem cell",
    "meaning": "A type of stem cell found in adults which is capable of differentiating into many kinds of cell found in the human body"
  },
  {
    "term": "Meristem",
    "meaning": "A region of unspecialised cells in a plant capable of mitosis at any point throughout the plant's life"
  },
  {
    "term": "Mitosis",
    "meaning": "The process of cell divison where a single cell produces two genetically identical 'daughter' cells"
  },
  {
    "term": "Therapeutic cloning",
    "meaning": "A process where an embryo is produced which has the same genes as a patient. Its stem cells will not be rejected by the body"
  },
  {
    "term": "Cell cycle",
    "meaning": "The series of stages which a cell goes through as it grows and divides"
  },
  {
    "term": "Diffusion",
    "meaning": "The process by which particles of a substance in solution, or of a gas, spread out in a way which results in a net movement from high concentration to low concentration"
  },
  {
    "term": "Osmosis",
    "meaning": "The process by which water molecules diffuse through a partially permeable membrane from a dilute solution to a concentrated one"
  },
  {
    "term": "Active transport",
    "meaning": "The process by which substances move through a partially permeable membrane against the concentration gradient, using energy from respiration"
  }
]
