[
  {
    "term": "Eukaryotic cell",
    "meaning": "A larger type of cell that contains a nucleus storing genetic information. Found in plants and animals."
  },
  {
    "term": "Prokaryotic cell",
    "meaning": "A smaller type of cell storing genetic material as a DNA loop, which may have one or two rings of DNA known as plasmids."
  },
  {
    "term": "Nucleus",
    "meaning": "An organelle found in eukaryotic cells that contains genetic material."
  },
  {
    "term": "Cytoplasm",
    "meaning": "The fluid that fills cells, consisting of water and solutes."
  },
  {
    "term": "Cell membrane",
    "meaning": "The partially permeable membrane that controls what enters and leaves a cell"
  },
  {
    "term": "Mitochondrion",
    "meaning": "An organelle where respiration occurs"
  },
  {
    "term": "Ribosome",
    "meaning": "An organelle responsible for protein synthesis"
  },
  {
    "term": "Chloroplast",
    "meaning": "An organelle found in plant cells that is responsible for photosynthesis"
  },
  {
    "term": "Vacuole",
    "meaning": "An organelle found in plant cells that stores cell sap"
  },
  {
    "term": "Cell wall",
    "meaning": "The outer cellulose layer of plant and algal cells responsible for strengthening the cell."
  },
  {
    "term": "Specialised cell",
    "meaning": "A cell that has adapted to carry out a particular function"
  },
  {
    "term": "Organelle",
    "meaning": "A sub-cellular structure specialised for a particular function"
  },
  {
    "term": "Differentiation",
    "meaning": "The process where an unspecialised stem cell gains individual characteristics and functions"
  },
  {
    "term": "Chromosome",
    "meaning": "A type of DNA structure found in the nucleus of a cell, usually in pairs"
  },
  {
    "term": "Gene",
    "meaning": "A section of a chromosome."
  },
  {
    "term": "Stem cell",
    "meaning": "An undifferentiated cell capable of creating specialised cells of a certain type."
  },
  {
    "term": "Embryonic stem cell",
    "meaning": "A type of stem cell found in embryos, capable of differentiating into almost all kinds of cell found in the human body"
  },
  {
    "term": "Adult stem cell",
    "meaning": "A type of stem cell found in adults, capable of differentiating into many kinds of cell found in the human body"
  },
  {
    "term": "Meristem",
    "meaning": "A region of unspecialised cells in a plant capable of mitosis at any point throughout the plant's life"
  },
  {
    "term": "Mitosis",
    "meaning": "The process where a single cell divides to produce two genetically identical 'daughter' cells"
  },
  {
    "term": "Therapeutic cloning",
    "meaning": "A process where an embryo is produced which has the same genes as a patient. Its stem cells will not be rejected by the body"
  },
  {
    "term": "Cell cycle",
    "meaning": "The series of stages which a cell goes through as it grows and divides, including mitosis."
  },
  {
    "term": "Diffusion",
    "meaning": "The process by which particles spread out, resulting in a net movement from high concentration to low concentration"
  },
  {
    "term": "Osmosis",
    "meaning": "The process by which water molecules diffuse through a partially permeable membrane from a dilute solution to a concentrated one"
  },
  {
    "term": "Active transport",
    "meaning": "The process by which substances move through a partially permeable membrane, using energy from respiration to move against the concentration gradient."
  }
]
