[
  {
    "term": "Steel pan",
    "meaning": "An instrument originally made from an oil drum, which is hammered in different areas to create different notes"
  },
  {
    "term": "Soprano pan/Ping Pong",
    "meaning": "The highest type of steel pan, responsible for the melody"
  },
  {
    "term": "Double Alto pan",
    "meaning": "The second highest type of steel pan, plays the countermelody"
  },
  {
    "term": "Single Alto pan",
    "meaning": "The type of steel pan responsible for playing two note chords"
  },
  {
    "term": "Cello/Guitar pan",
    "meaning": "The second lowest type of steel pan, plays the chords, bass or sometimes the melody."
  },
  {
    "term": "Bass pan",
    "meaning": "The lowest type of steel pan, playing the bass part"
  },
  {
    "term": "Claves",
    "meaning": "A percussion instrument comprised of two wooden sticks which are hit together"
  },
  {
    "term": "Maracas",
    "meaning": "A type of shaker filled with pebbles, beans or similar objects"
  },
  {
    "term": "Agogo",
    "meaning": "2 metallic bells of different pitches, joined together and played with a stick"
  },
  {
    "term": "Congas",
    "meaning": "A pair of single-headed, tall drums played with the hands"
  },
  {
    "term": "Cabasa",
    "meaning": "A percussion instrument comprised of loops of steel ball chain wrapped round a wooden cylinder"
  },
  {
    "term": "Güiro",
    "meaning": "A wooden percussion instrument with several notches, which are rubbed against with a stick."
  },
  {
    "term": "Improvisation",
    "meaning": "Where music is made up on the spot. Often used in call and response sections of a Calypso piece"
  },
  {
    "term": "Call and response",
    "meaning": "Where one melody is 'answered' by another"
  },
  {
    "term": "Syncopation",
    "meaning": "Rhythms with accents placed on weak beats"
  },
  {
    "term": "Primary chords",
    "meaning": "Chords I, IV and V, which are all closely related to the tonic chord"
  },
  {
    "term": "Tremolo",
    "meaning": "A trembling effect produced by playing the same note repeatedly. Used in Calypso music to give the illusion of a long note"
  },
  {
    "term": "Trinidad and Tobago",
    "meaning": "A dual-island nation located in the Carribean where Calypso music was created"
  }
]