[
  {
    "term": "Contraction in Demand",
    "meaning": "Movement along the demand curve to the left (higher price & lower quantity demanded)."
  },
  {
    "term": "Demand",
    "meaning": "A consumer's desire, willingness and ability to pay a price for a specific good or service."
  },
  {
    "term": "Demand Curve",
    "meaning": "Graph that shows the different quantity of a product demanded at different price levels."
  },
  {
    "term": "Disposable Income",
    "meaning": "The money available after paying taxes that you can choose how to use."
  },
  {
    "term": "Effective Demand",
    "meaning": "The financial ability to actually purchase the product."
  },
  {
    "term": "Indirect Taxes",
    "meaning": "Taxation on spending (VAT, excise duties, import taxes)"
  },
  {
    "term": "Individual Demand",
    "meaning": "The amount a single person would be willing to buy at a range of prices."
  },
  {
    "term": "Infrastructure",
    "meaning": "Basic systems government's need to make economic activity possible, e.g. transport and communications"
  },
  {
    "term": "Inverse Relationship",
    "meaning": "When one variable goes up the other variable goes down."
  },
  {
    "term": "Market Demand",
    "meaning": "Total demand for a product"
  },
  {
    "term": "Movement",
    "meaning": "When a change in price causes a new point on the existing curve."
  },
  {
    "term": "Shift",
    "meaning": "When and increase in one variable moves the entire curve to a new location"
  },
  {
    "term": "Contraction in Supply",
    "meaning": "Movement along the supply curve to the left (lower price & lower quantity supplied)."
  },
  {
    "term": "Proportionate Relationship",
    "meaning": "When price goes up quantity supplied goes up and visa versa"
  },
  {
    "term": "Supply",
    "meaning": "The number of goods/services firms are able & willing to supply at a range of prices."
  },
  {
    "term": "Supply Curve",
    "meaning": "Graph that shows the different quantity of a product supplied at different price levels."
  },
  {
    "term": "Volatile",
    "meaning": "Changing quickly and suddenly"
  },
  {
    "term": "Equilibrium Price",
    "meaning": "The point at which quantity demanded and quantities supplied are equal."
  },
  {
    "term": "Excess Demand",
    "meaning": "Where quantity demanded of a good or service exceeds supply, resulting in shortages and higher prices."
  },
  {
    "term": "Excess Supply",
    "meaning": "Where quantity supplied of a good or service exceeds supply, resulting in shortages and higher prices."
  },
  {
    "term": "Extension in Demand",
    "meaning": "A movement along the demand curve to the right (lower price & higher quantity demanded)."
  },
  {
    "term": "Extension in Supply",
    "meaning": "A movement along the supply curve to the right (higher price & higher quantity supplied)."
  },
  {
    "term": "Market Clearing Price",
    "meaning": "Price at which the amount supplied matches the exact amount demanded."
  },
  {
    "term": "Complementary goods",
    "meaning": "Goods that are purchased to support/go with another product (petrol & cars)."
  },
  {
    "term": "Inferior Goods",
    "meaning": "Goods that consumers demand less of as incomes increase due to them opting to buy higher quality alternatives."
  },
  {
    "term": "Normal Good",
    "meaning": "Goods for which demand will increase if incomes do or fall if incomes fall."
  },
  {
    "term": "Substitutes",
    "meaning": "Goods or services that can be used to replace on another."
  },
  {
    "term": "Elasticity",
    "meaning": "The responsiveness of quantity supplied or demanded in relation to changes in price/income/other products."
  },
  {
    "term": "Perfect",
    "meaning": "Where one variable (Price or quantity) is fixed and the other variable cannot change it."
  },
  {
    "term": "Price Elastic Demand",
    "meaning": "When PED is greater than 1 and A % change in price results in greater % change in quantity demanded."
  },
  {
    "term": "Price elasticity of demand (PED)",
    "meaning": "The responsiveness in quantity demanded to a change in price. \nFormula: % change in QD / % Change in P"
  },
  {
    "term": "Price Inelastic Demand",
    "meaning": "When PED is less than 1 and quantity demanded is not very responsive to a change in price.\nFormula: % change in Qs / % change in P"
  },
  {
    "term": "Fast-moving consumer good (FMCG)",
    "meaning": "products that sell quickly at a relatively low cost"
  },
  {
    "term": "Price Elastic Supply",
    "meaning": "When PES is greater than 1 and quantity supplied is very responsive to a change in price."
  },
  {
    "term": "Price elasticity of supply (PES)",
    "meaning": "The responsiveness in quantity supplied to a change in price."
  },
  {
    "term": "Price Inelastic Supply",
    "meaning": "When PES is less than 1 and quantity supplied is not very responsive to a change in price."
  },
  {
    "term": "Raw Materials",
    "meaning": "Substances used to make other things, e.g. Crude Oil"
  }
]
