[
    {
        "term": "Algorithm",
        "meaning": "A set of instructions to complete a task or solve a problem"
    },
    {
        "term": "Decomposition",
        "meaning": "The process of dividing a problem into more manageable sub-problems, which are then divided further and so on."
    },
    {
        "term": "Abstraction",
        "meaning": "The process of removing unnecessary details from a problem to focus on the important parts"
    },
    {
        "term": "Pseudocode",
        "meaning": "A notation resembling a programming language, used to describe the steps in an algorithm or the logic flow of an algorithm"
    },
    {
        "term": "Flowchart",
        "meaning": "A type of diagram using arrows and boxes, which allows the programmer to visualise an algorithm before it is turned into code."
    },
    {
        "term": "Input",
        "meaning": "The data that is sent to a program to be processed"
    },
    {
        "term": "Processing",
        "meaning": "The application of an algorithm to inputted data."
    },
    {
        "term": "Output",
        "meaning": "The data that is sent out of a program to be shown to the user."
    },
    {
        "term": "Efficiency",
        "meaning": "The amount of time and/or resources required to complete a task"
    },
    {
        "term": "Searching Algorithm",
        "meaning": "An algorithm that locates a specific item in a dataset"
    },
    {
        "term": "Sorting Algorithm",
        "meaning": "An algorithm that sorts a dataset into a specific order"
    },
    {
        "term": "Linear search",
        "meaning": "A searching algorithm that searches through a dataset one at a time, until the item is found"
    },
    {
        "term": "Binary search",
        "meaning": "A searching algorithm that recursively splits the dataset in half and compares the item to be found to the item halfway through the dataset."
    },
    {
        "term": "Bubble sort",
        "meaning": "A sorting algorithm that compares two items at a time, swapping them if they are in the wrong order, until the entire dataset is sorted."
    },
    {
        "term": "Merge sort",
        "meaning": "A sorting algorithm that recursively splits a dataset into two halves, sorts each one separately and merges the two sorted lists back together."
    },
    {
        "term": "Insertion sort",
        "meaning": "A sorting algorithm which moves each item left until the item to its left is less than it."
    }
]
